; domain
(define (domain Depot)
(:requirements :strips :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place)
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))

(:action Drive
  :parameters (?x - truck ?y - place ?z - place)
  :precondition (and (at ?x ?y))
  :effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
  :effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) (clear ?z) (not (on ?y ?z))))

(:action Drop
  :parameters (?x - hoist ?y - crate ?z - surface ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
  :effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)(on ?y ?z)))

(:action Load
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
  :effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload
  :parameters (?x - hoist ?y - crate ?z - truck ?p - place)
  :precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
  :effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))
)

; problem
(define (problem depotprob37) (:domain Depot)
(:objects
	depot0 depot1 depot2 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 depot1)
	(clear crate3)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 distributor0)
	(clear crate1)
	(at pallet4 distributor1)
	(clear pallet4)
	(at pallet5 distributor2)
	(clear crate5)
	(at pallet6 distributor0)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 depot1)
	(clear crate6)
	(at pallet10 depot1)
	(clear pallet10)
	(at pallet11 distributor1)
	(clear crate7)
	(at pallet12 depot1)
	(clear pallet12)
	(at truck0 distributor2)
	(at truck1 depot1)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor2)
	(available hoist6)
	(at hoist7 depot0)
	(available hoist7)
	(at hoist8 depot2)
	(available hoist8)
	(at crate0 distributor2)
	(on crate0 pallet5)
	(at crate1 distributor0)
	(on crate1 pallet3)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 depot1)
	(on crate3 crate2)
	(at crate4 depot0)
	(on crate4 pallet0)
	(at crate5 distributor2)
	(on crate5 crate0)
	(at crate6 depot1)
	(on crate6 pallet9)
	(at crate7 distributor1)
	(on crate7 pallet11)
)

(:goal (and
		(on crate0 crate6)
		(on crate1 pallet3)
		(on crate2 pallet5)
		(on crate3 pallet10)
		(on crate5 crate7)
		(on crate6 pallet1)
		(on crate7 pallet9)
	)
))

; plan
1. (lift hoist5 crate5 crate0 distributor2)
   deleted: (at crate5 distributor2) (clear crate5) (available hoist5) (on crate5 crate0)
   added: (lifting hoist5 crate5) (clear crate0)
   goals met: 1 of 7
2. (load hoist5 crate5 truck0 distributor2)
   deleted: (lifting hoist5 crate5)
   added: (in crate5 truck0) (available hoist5)
   goals met: 1 of 7
3. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   goals met: 1 of 7
4. (lift hoist6 crate0 pallet5 distributor2)
   deleted: (at crate0 distributor2) (clear crate0) (available hoist6) (on crate0 pallet5)
   added: (lifting hoist6 crate0) (clear pallet5)
   goals met: 1 of 7
5. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 1 of 7
6. (load hoist6 crate0 truck1 distributor2)
   deleted: (lifting hoist6 crate0)
   added: (in crate0 truck1) (available hoist6)
   goals met: 1 of 7
7. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 1 of 7
8. (lift hoist1 crate3 crate2 depot1)
   deleted: (at crate3 depot1) (clear crate3) (available hoist1) (on crate3 crate2)
   added: (lifting hoist1 crate3) (clear crate2)
   goals met: 1 of 7
9. (load hoist1 crate3 truck1 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck1) (available hoist1)
   goals met: 1 of 7
10. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (clear crate2) (available hoist1) (on crate2 pallet1)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 1 of 7
11. (load hoist1 crate2 truck1 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck1) (available hoist1)
   goals met: 1 of 7
12. (drive truck1 depot1 distributor2)
   deleted: (at truck1 depot1)
   added: (at truck1 distributor2)
   goals met: 1 of 7
13. (unload hoist6 crate2 truck1 distributor2)
   deleted: (in crate2 truck1) (available hoist6)
   added: (lifting hoist6 crate2)
   goals met: 1 of 7
14. (drive truck1 distributor2 depot1)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot1)
   goals met: 1 of 7
15. (drop hoist6 crate2 pallet5 distributor2)
   deleted: (lifting hoist6 crate2) (clear pallet5)
   added: (available hoist6) (at crate2 distributor2) (clear crate2) (on crate2 pallet5)
   goals met: 2 of 7
16. (unload hoist1 crate3 truck1 depot1)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   goals met: 2 of 7
17. (drop hoist1 crate3 pallet10 depot1)
   deleted: (lifting hoist1 crate3) (clear pallet10)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 pallet10)
   goals met: 3 of 7
18. (lift hoist1 crate6 pallet9 depot1)
   deleted: (at crate6 depot1) (clear crate6) (available hoist1) (on crate6 pallet9)
   added: (lifting hoist1 crate6) (clear pallet9)
   goals met: 3 of 7
19. (drop hoist1 crate6 pallet1 depot1)
   deleted: (lifting hoist1 crate6) (clear pallet1)
   added: (available hoist1) (at crate6 depot1) (clear crate6) (on crate6 pallet1)
   goals met: 4 of 7
20. (unload hoist1 crate0 truck1 depot1)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   goals met: 4 of 7
21. (drop hoist1 crate0 crate6 depot1)
   deleted: (lifting hoist1 crate0) (clear crate6)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 crate6)
   goals met: 5 of 7
22. (lift hoist4 crate7 pallet11 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 pallet11)
   added: (lifting hoist4 crate7) (clear pallet11)
   goals met: 5 of 7
23. (load hoist4 crate7 truck0 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck0) (available hoist4)
   goals met: 5 of 7
24. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 5 of 7
25. (unload hoist1 crate7 truck0 depot1)
   deleted: (in crate7 truck0) (available hoist1)
   added: (lifting hoist1 crate7)
   goals met: 5 of 7
26. (drop hoist1 crate7 pallet9 depot1)
   deleted: (lifting hoist1 crate7) (clear pallet9)
   added: (available hoist1) (at crate7 depot1) (clear crate7) (on crate7 pallet9)
   goals met: 6 of 7
27. (unload hoist1 crate5 truck0 depot1)
   deleted: (in crate5 truck0) (available hoist1)
   added: (lifting hoist1 crate5)
   goals met: 6 of 7
28. (drop hoist1 crate5 crate7 depot1)
   deleted: (lifting hoist1 crate5) (clear crate7)
   added: (available hoist1) (at crate5 depot1) (clear crate5) (on crate5 crate7)
   goals met: 7 of 7
